function showCategory(category) {
    document.getElementById('category-title').textContent = category;
    document.getElementById('product-list').innerHTML = "";
    let products = {
        'Фрукти': [
            { name: 'Полуни́ці садо́ві', description: 'Багаторічна рослина роду суниці родини розових...' },
            { name: 'Мали́на', description: 'За ботанічною класифікацією плід малини — не ягода, а багатокістянка...' },
            { name: 'Пе́рсик', description: 'Багаторічна рослина родини розових, споріднена з мигдалем...' }
        ],
        'Овочі': [
            { name: 'Капу́ста', description: 'Рід рослин з родини капустяних (Brassicaceae)...' },
            { name: 'Карто́пля', description: 'Важлива сільськогосподарська культура, відома як «другий хліб»...' },
            { name: 'Морква', description: 'Їстівний коренеплід моркви посівної, багатий на вітаміни та мікроелементи...' }
        ],
        'Крупи': [
            { name: 'Манна крупа́', description: 'Пшеничні крупи дрібного помелу з середнім діаметром часток від 0,25 до 0,75 мм...' },
            { name: 'Куску́с', description: 'Крупа, що походить з країн Магрибу, виготовлена із зерен пшениці або проса...' },
            { name: 'Булгу́р', description: 'Крупа з обробленої окропом, висушеної та подрібненої пшениці...' }
        ]
    };
    let productList = products[category];
    productList.forEach(function(product) {
        let productDiv = document.createElement('div');
        productDiv.innerHTML = '<p><a href="#" onclick="showProductInfo(\'' + product.name + '\')">' + product.name + '</a></p>';
        document.getElementById('product-list').appendChild(productDiv);
    });
}
function showProductInfo(productName) {
    let productInfo = {
        'Полуни́ці садо́ві': 'Багаторічна рослина роду суниці родини розових. Являє собою гібрид, виведений штучно від схрещування двох американських видів — суниць чилійських і суниць вірґінських. Суниці садові — одна з найпоширеніших в Україні ягідних культур. Полуницями часто називають й інші види роду Fragaria — суниці зелені та суниці мускусні.',
        'Мали́на': 'За ботанічною класифікацією плід малини — не ягода, а багатокістянка. Складається з декількох десятків зрощених кістянок (плодиків з кісточками), прикріплені до білої конічної плодоніжки і зібраних навколо неї в округлу голівку. Після того як дозріває, від квітколожа відділяється легко. Колір — зазвичай червоний (малиново-червоний), також може бути білим, жовтим, рожевим.',
        'Пе́рсик': 'Багаторічна рослина родини розових, споріднена з мигдалем. Вельми популярна і поширена плодова культура, яку також використовують як олійну, лікарську та декоративну.',
        'Капу́ста' : 'рід рослин з родини капустяних (Brassicaceae). Рослини цього роду можуть бути колективно відомі як капустяні або як гірчичні.До роду входять дикорослі види і культурні форми капусти, деякі коренеплоди (ріпа, бруква тощо); олійні та пряні культури (ріпак, гірчиця та ін.).Цей рід відомий тим, що містить більше важливих сільськогосподарських та садових культур, ніж будь-який інший рід. Він також містить низку бур`янів, включаючи 30 диких видів і гібридів. Більшість з них є однорічними або дворічними рослинами, але деякі є малими чагарниками', 'Карто́пля' : 'вид рослин родини пасльонових, поширена сільськогосподарська культура, яку в народі називають «другим хлібом» , одна з найважливіших продовольчих, технічних і кормових культур',
        'Морква' : 'їстівний коренеплід моркви посівної, багатий на вітаміни та мікроелементи. За змістом каротину морква поступається лише солодкому перцю. Моркву і морквяний сік призначають хворим на гіпо- та авітаміноз А' ,
        'Манна крупа́' : 'пшеничні крупи дрібного помелу з середнім діаметром часток від 0,25 до 0,75 мм. Виробляються з твердої пшениці (марка «Т»), м`якої пшениці (марка «М») або їх суміші (марка «МТ)»' ,
        'Куску́с' : 'крупа, а також страва з неї, що походить з країн Магрибу. Її виготовляють із зерен пшениці (манної крупи) або проса. Для приготування кускусу використовується груба манна крупа, яку збивають у більші частинки, просіюють через сито та висушують',
        'Булгу́р' :  'крупа з обробленої окропом, висушеної та подрібненої пшениці. З давніх часів є широко поширеним продуктом на Близькому Сході та у Середземномор`ї'
    };
    let productDescription = productInfo[productName];
    document.getElementById('product-info').innerHTML = '<p><strong>' + productName + '</strong></p><p>' + productDescription + '</p>';
}
function buyProduct() {
    alert('Товар куплений');
    document.getElementById('category-title').textContent = 'Виберіть категорію';
    document.getElementById('product-list').innerHTML = "";
    document.getElementById('product-info').innerHTML = "";
}